{
    "version": "https://jsonfeed.org/version/1",
    "title": "psychronos.com",
    "description": "",
    "home_page_url": "https://psychronos.com",
    "feed_url": "https://psychronos.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Andrew Zhu"
    },
    "items": [
        {
            "id": "https://psychronos.com/a-shares-vs-us-stocks-why-i-switched-and-achieved-financial-freedom/index.html",
            "url": "https://psychronos.com/a-shares-vs-us-stocks-why-i-switched-and-achieved-financial-freedom/index.html",
            "title": "A-Shares vs U.S. Stocks: Why I Switched and Achieved Financial Freedom",
            "summary": "For years, I have been investing in the China A-share market, but making consistent profits was challenging. High volatility, government policies, and retail investor dominance made it difficult to achieve long-term growth. That’s why I decided to explore US stock market investing, which turned out&hellip;",
            "content_html": "<p>For years, I have been investing in the China A-share market, but making consistent profits was challenging. High volatility, government policies, and retail investor dominance made it difficult to achieve long-term growth. That’s why I decided to explore US stock market investing, which turned out to be a game-changer. In this post, I will compare A-shares vs US stocks and share why I transitioned to US investments.</p><h2 id=\"1-my-a-share-investing-journey-from-enthusiasm-to-harsh-reality-2008-2015\">1. My A-Share Investing Journey: From Enthusiasm to Harsh Reality (2008-2015)</h2>\n<p>In 2008, I stepped into the A-share market with boundless enthusiasm and the belief that through diligent learning and in-depth research, I could secure a share of the capital market’s wealth. Yet, the harsh realities of the A-share market crushed my naive optimism, leaving me battered and disillusioned.</p><h3 id=\"11-2008-2013-why-the-a-share-bear-market-crushed-retail-investors\">1.1. 2008-2013: Why the A-Share Bear Market Crushed Retail Investors</h3>\n<p>The timing of my entry into the A-share market was far from ideal. After the Shanghai Composite Index reached its peak of 6124 points in 2007, the global financial crisis of 2008 caused the A-share market to plummet to 1664 points within a year, a staggering drop of 72%. At that time, market analysts were touting a “golden decade,” leading me to mistakenly believe that a strong rebound would follow the crash.</p><p>However, the reality was that from 2009 to 2013, the A-share market did not experience a true bull market but remained in a prolonged bear market characterized by volatility and decline. Although there were occasional rebounds, each was mercilessly crushed, with the index hovering between 2000 and 2500 points.</p><p>What truly shattered my confidence was the stark realization that the A-share market was anything but a level playing field. During those years, I witnessed numerous instances of institutional manipulation, such as:</p><p>Market manipulation was rampant, with small-cap stocks artificially inflated to attract retail investors, only to be dumped abruptly, leaving them with heavy losses.\nExecutive Share Sales: Some listed companies engaged in large-scale share sales at high prices, followed by a continuous decline in stock prices, leaving retail investors to bear the losses.\nInsider Trading: The market was rife with rumors of “institutional insider information,” but ordinary investors rarely had access to such information in advance, often ending up as the “cabbage” being harvested.\nDuring this period, I tried short-term trading multiple times, hoping to reduce losses through swing trading. However, due to the overall market downturn, each rebound became a selling point, leading to continuous losses and a gradual loss of confidence.</p><h3 id=\"12-2014-2015-the-a-share-bubblefrom-bull-market-to-brutal-crash\">1.2. 2014-2015: The A-Share Bubble—From Bull Market to Brutal Crash</h3>\n<p>In 2014, the A-share market finally experienced a bull market. Within a year and a half, the Shanghai Composite Index soared from 2000 points to 5178 points, with market sentiment reaching a fever pitch, and it seemed that everyone was making money. I was no exception, and my account balance doubled rapidly during this bull market, leading me to believe that I had finally grasped the market’s rhythm.</p><p>However, I overlooked a crucial issue—the essence of this bull market was not driven by economic growth but was a bubble inflated by leveraged funds and speculative hype.</p><p>In June 2015, the A-share bubble burst, and the market crashed nearly 50% within just two months. Leveraged funds were forcibly liquidated, and a large number of retail investors were forced to sell at a loss. I was not spared, with not only my profits vanishing but also my losses exceeding the principal I had before the bull market. I still remember the despair of that time:</p><p>Each morning, I woke up to the dreaded sight of another limit-down freeze—my holdings locked, my hopes crushed, and my screen bathed in a sea of red. It was financial despair in its rawest form.\nRegulatory authorities introduced various measures to save the market, but market confidence had already collapsed, and any rebound was short-lived.\nThe market was filled with the painful sounds of investors cutting their losses and clearing their positions, with friends around me leaving the market one after another.</p><h3 id=\"13-why-a-shares-struggle-to-sustain-long-term-bull-markets\">1.3. Why A-Shares Struggle to Sustain Long-Term Bull Markets</h3>\n<p>After experiencing the roller-coaster ride of the A-share market, I finally realized why it is so challenging for this market to sustain a long-term bull run. The A-share market, despite its significant growth over the years, faces several inherent issues that make it difficult to maintain prolonged periods of bullish momentum.</p><p>One of the primary issues is the market’s structure. In stark contrast to the U.S. stock market—where shareholder value is paramount—the A-share market operates primarily as a capital-raising tool for companies, often treating retail investors as mere liquidity providers, rather than true stakeholders. This means that when the market rises, companies are more likely to issue new shares or sell existing ones to raise capital, which can put downward pressure on stock prices and make it difficult for a bull market to last.</p><p>Another significant problem is the dominance of retail investors. More than 70% of the A-share market is composed of retail investors, who are more prone to emotional trading. This leads to significant market volatility, with investors buying on rises and selling on declines, creating a cycle of manic bulls and devastating crashes. The lack of institutional investors, who typically have a more long-term and stable investment approach, further exacerbates this issue.</p><p>Regulatory issues also play a crucial role. The A-share market has faced persistent problems such as inadequate market oversight and insufficient transparency in listed company disclosures. This lack of transparency and regulatory oversight can lead to market ambiguity and investor sentiment-driven anomalies, making it difficult for the market to maintain a stable and sustained upward trend.</p><p>Furthermore, the market’s susceptibility to speculative bubbles and crashes is a major obstacle. The A-share market has a history of experiencing rapid inflows of hot money, leading to the formation of bubbles, followed by sudden crashes. This was evident during the 2015 market crash, which was the final straw that shattered my confidence in A-shares. The market’s inability to avoid such extreme fluctuations makes it challenging to sustain a long-term bull market.</p><p>In summary, the A-share market’s focus on corporate financing, the dominance of retail investors, regulatory shortcomings, and susceptibility to speculative bubbles all contribute to its difficulty in maintaining a sustainable uptrend. These issues need to be addressed for the market to achieve sustained growth and provide better returns for investors.</p><h2 id=\"2-china-vs-us-stock-market-key-differences-for-investors\">2. China vs. U.S. Stock Market: Key Differences for Investors</h2>\n<p>Before switching to the U.S. stock market, I delved into the mechanics of both the Chinese and American markets. It became clear to me that the two are fundamentally different in how they operate.</p><h3 id=\"21-how-the-us-stock-market-prioritizes-investors-over-companies\">2.1. How the U.S. Stock Market Prioritizes Investors Over Companies</h3>\n<p>The U.S. stock market is designed with investors in mind. Companies are under pressure to generate long-term value to maintain high valuations, and management places greater emphasis on shareholder interests, rewarding investors through stock buybacks and dividends. This investor-centric approach ensures that companies focus on creating value for their shareholders, leading to more sustainable and reliable returns.</p><h3 id=\"22-why-institutional-investors-dominate-the-us-stock-market\">2.2. Why Institutional Investors Dominate the U.S. Stock Market</h3>\n<p>The U.S. stock market is driven by institutional investors who focus on the fundamentals of companies, resulting in more moderate market fluctuations and more stable trends. These investors typically have a long-term investment horizon and are less prone to emotional trading, which contributes to the overall stability of the market. Their focus on fundamentals and long-term value creation helps to mitigate the volatility that can be caused by short-term speculation.</p><h3 id=\"23-strong-regulations-and-transparency-the-us-market-advantage\">2.3. Strong Regulations and Transparency: The U.S. Market Advantage</h3>\n<p>The U.S. stock market boasts more transparent information disclosure and stricter regulation, enabling investors to make informed decisions. Listed companies are required to provide detailed and timely financial reports, and the Securities and Exchange Commission (SEC) enforces strict compliance standards. This transparency and regulatory oversight give investors confidence in the market and help to prevent fraud and manipulation.</p><h3 id=\"24-us-stocks-vs-a-shares-why-long-term-investors-prefer-the-sp-500\">2.4. U.S. Stocks vs. A-Shares: Why Long-Term Investors Prefer the S&amp;P 500</h3>\n<p>Over the past 30 years, the S&amp;P 500 has delivered an average annual return of nearly 10%, with long-term holding leading to stable appreciation. This consistent performance is a testament to the market’s ability to provide reliable returns over time. The focus on long-term value creation and the stability of the market make it an attractive destination for investors seeking to grow their wealth over the long term. In contrast, the Shanghai Composite Index has not surpassed its 2007 high to this day, and long-term holding of the major index is difficult to yield good returns.</p><p>In summary, the U.S. stock market’s investor-centric design, dominance of institutional investors, strong regulatory environment, and consistent long-term performance make it a more attractive investment environment. These factors contribute to a market that is more stable, transparent, and focused on creating value for investors.</p><h2 id=\"3-why-i-switched-to-us-stocks-and-survived-three-market-crashes\">3. Why I Switched to U.S. Stocks and Survived Three Market Crashes</h2>\n<p>These comparisons made me realize that my losses in the A-share market were not just due to my personal investment skills but were determined by the market’s structure, making it difficult for retail investors to profit in the long term. I decided to give up short-term speculation in the A-share market and switch to the U.S. stock market, readjusting my investment methods.</p><p>However, it was my experience of three market fluctuations that truly solidified my belief in the long-term value of the U.S. stock market: the 2018 bear market, the 2020 pandemic circuit breakers, and the 2022 interest rate hike crash.</p><h3 id=\"31-the-2018-bear-market-my-first-reality-check-in-us-stocks\">3.1. The 2018 Bear Market: My First Reality Check in U.S. Stocks</h3>\n<p>At the end of 2018, as the Federal Reserve continued to raise interest rates and the U.S.-China trade friction escalated, the market entered a correction, with the S&amp;P 500 index falling more than 20% within three months, officially entering a technical bear market. Having just switched to the U.S. stock market, I was shaken by the significant drawdown in my account:</p><p>Could it be that the U.S. stock market also has short bulls and long bears like the A-share market?</p><p>However, I noticed that, unlike the A-share market, there was no panic selling in the U.S. stock market, and institutional investors were still increasing their holdings in tech leaders. I decided to trust in the market’s long-term value and not only did I not sell, but I also took the opportunity to add to my positions in Apple (AAPL) and Microsoft (MSFT).</p><p>It turned out that this decision was correct. In 2019, the Federal Reserve stopped raising interest rates, and the market rebounded quickly, with tech stocks reaching new highs. This experience truly made me understand the logic behind the “long bull market” of the U.S. stock market: the market’s long-term confidence in high-quality enterprises is much stronger than short-term fluctuations.</p><h3 id=\"32-the-2020-market-crash-how-i-handled-the-covid-19-circuit-breakers\">3.2. The 2020 Market Crash: How I Handled the COVID-19 Circuit Breakers</h3>\n<p>In March 2020, the outbreak of the COVID-19 pandemic led to four circuit breakers in the U.S. stock market within a month, with the S&amp;P 500 index plunging 35%. This was an extreme test of investors’ psychology, with news filled with panic-inducing statements such as “global economic recession” and “U.S. stock market crash.”</p><p>As panic gripped the market, I found myself at a crossroads—should I sell everything to cut my losses, or should I hold on, believing in the market’s resilience?</p><p>So, I reviewed the case of the 2008 financial crisis and found that the S&amp;P 500 bottomed out in March 2009 and then rose continuously for a decade. This made me determined to add to my positions in QQQ (NASDAQ 100 ETF) and VTI (Total Market ETF) when the U.S. stock market hit bottom on March 23.</p><p>A few months later, the Federal Reserve implemented unlimited QE, and the U.S. stock market experienced an epic rebound, with the S&amp;P 500 index recouping all its losses within half a year, and tech stocks reaching new highs. This experience further solidified my belief that market confidence and policy support are the core drivers of the long-term rise of the U.S. stock market.</p><h3 id=\"33-how-i-stayed-invested-during-the-2022-interest-rate-crash\">3.3. How I Stayed Invested During the 2022 Interest Rate Crash</h3>\n<p>In 2022, the Federal Reserve aggressively raised interest rates to combat inflation, causing the market to plummet sharply. Tech stocks were hit the hardest, with the NASDAQ index falling more than 35% for the year. My investment portfolio suffered significant drawdowns, even returning to the level of 2020 at one point.</p><p>But this time, my mentality was more stable than before. I knew:</p><p>The long-term trend of the U.S. stock market depends on corporate earnings, not short-term interest rate fluctuations.\nMost tech companies are still growing, and short-term valuation compression does not affect their long-term value.\nSo, I chose to stay the course and continue holding high-quality assets. As it turned out, the U.S. stock market gradually warmed up in 2023, with tech stocks leading the market, and my investment portfolio also welcomed growth again.</p><h2 id=\"4-final-thoughts-how-you-can-achieve-financial-freedom-through-investing\">4. Final Thoughts: How You Can Achieve Financial Freedom Through Investing</h2>\n<p>My experiences during these three significant market downturns have only strengthened my belief in the long-term investment value of the U.S. stock market. The reasons are clear:</p><p>The U.S. stock market has a proven track record of bouncing back after each crisis, welcoming new bull markets with open arms. This resilience is a testament to the market’s confidence in high-quality enterprises and its ability to recover and thrive. The Federal Reserve’s monetary policy has a direct and positive impact on the market, providing the necessary support for long-term growth. This stability is in stark contrast to the A-share market, which is subject to more frequent and unpredictable policy interventions. U.S. tech leaders, such as Apple (AAPL), Microsoft (MSFT), and Alphabet (GOOGL), have demonstrated continuous innovation capabilities and long-term growth potential. These companies are global giants that drive the market forward, something the A-share market currently lacks.</p><p>The road to financial freedom is not a sprint—it’s a marathon paved with informed decisions and unwavering patience. If A-shares have left you exhausted and disillusioned, perhaps it’s time to turn the page and explore a market where investors aren’t just an afterthought, but the very heart of the system.</p><p>May you find your own path to financial freedom through wise investment choices!</p>",
            "author": {
                "name": "Andrew Zhu"
            },
            "tags": [
                   "U.S. Stocks",
                   "A-Shares"
            ],
            "date_published": "2025-02-13T02:16:54-05:00",
            "date_modified": "2025-02-13T02:18:09-05:00"
        }
    ]
}
